#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[33mRunning plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
The remote workspace is configured to work with configuration at
aws relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infra/infra/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infra/infra

[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/femiwiki/aws/runs/run-AYHUb5sxPi2qdEka[0m
[0m
Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
[0m[1maws_ses_domain_identity.femiwiki_com: Refreshing state... [id=femiwiki.com][0m
[0m[1maws_ses_email_identity.admin: Refreshing state... [id=admin@femiwiki.com][0m
[0m[1maws_ses_domain_dkim.femiwiki_com: Refreshing state... [id=femiwiki.com][0m
[0m[1maws_iam_group.admin: Refreshing state... [id=Admin][0m
[0m[1maws_key_pair.femiwiki_green: Refreshing state... [id=femiwiki-emergency-key][0m
[0m[1mdata.aws_iam_policy_document.sns_default_policy: Reading...[0m[0m
[0m[1maws_key_pair.femiwiki: Refreshing state... [id=femiwiki-2018-09-15][0m
[0m[1mdata.aws_availability_zone.femiwiki: Reading...[0m[0m
[0m[1maws_s3_bucket.uploaded_files_temp: Refreshing state... [id=femiwiki-uploaded-files-temp][0m
[0m[1mdata.aws_ami.amazon_linux_2_arm64: Reading...[0m[0m
[0m[1maws_default_subnet.default["c"]: Refreshing state... [id=subnet-e5d929bd][0m
[0m[1mdata.aws_iam_policy_document.sns_default_policy: Read complete after 0s [id=1085221790][0m
[0m[1maws_s3_bucket.uploaded_files_deleted: Refreshing state... [id=femiwiki-uploaded-files-deleted][0m
[0m[1maws_route53_health_check.femiwiki_main_page: Refreshing state... [id=6f01b5f3-bb0c-44c8-8dd3-79be07f8cc54][0m
[0m[1maws_default_subnet.default["d"]: Refreshing state... [id=subnet-2581d80d][0m
[0m[1maws_default_subnet.default["a"]: Refreshing state... [id=subnet-9da70beb][0m
[0m[1mdata.aws_iam_policy_document.ses_sending_access: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.ses_sending_access: Read complete after 0s [id=1502809120][0m
[0m[1maws_route53_zone.femiwiki_com: Refreshing state... [id=Z1IOLPZGUQYUUT][0m
[0m[1mdata.aws_iam_policy_document.instance_assume_role: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.instance_assume_role: Read complete after 0s [id=1903849331][0m
[0m[1maws_default_vpc.default: Refreshing state... [id=vpc-a4749ac0][0m
[0m[1mdata.aws_availability_zone.femiwiki: Read complete after 1s [id=ap-northeast-1a][0m
[0m[1mdata.aws_iam_policy_document.github_lambda: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.github_lambda: Read complete after 0s [id=1154973437][0m
[0m[1maws_s3_bucket.backups: Refreshing state... [id=femiwiki-backups][0m
[0m[1mdata.aws_iam_policy_document.force_mfa: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.force_mfa: Read complete after 0s [id=1721518048][0m
[0m[1maws_s3_bucket.secrets: Refreshing state... [id=femiwiki-secrets][0m
[0m[1maws_s3_bucket.uploaded_files: Refreshing state... [id=femiwiki-uploaded-files][0m
[0m[1mdata.aws_iam_policy_document.terraform_cloud: Reading...[0m[0m
[0m[1maws_s3_bucket.uploaded_files_thumb: Refreshing state... [id=femiwiki-uploaded-files-thumb][0m
[0m[1mdata.aws_iam_policy_document.terraform_cloud: Read complete after 0s [id=3352325900][0m
[0m[1maws_iam_account_password_policy.strict: Refreshing state... [id=iam-account-password-policy][0m
[0m[1maws_iam_user.programmatic_users["femiwiki-email"]: Refreshing state... [id=femiwiki-email][0m
[0m[1maws_iam_user.programmatic_users["github-lambda"]: Refreshing state... [id=github-lambda][0m
[0m[1maws_iam_user.programmatic_users["terraform-cloud"]: Refreshing state... [id=terraform-cloud][0m
[0m[1maws_iam_group.readonly: Refreshing state... [id=ReadOnly][0m
[0m[1maws_sns_topic.cloudwatch_alarms_topic: Refreshing state... [id=arn:aws:sns:ap-northeast-1:302617221463:CloudWatch_Alarms_Topic][0m
[0m[1maws_iam_group_policy_attachment.admin_permission: Refreshing state... [id=Admin-arn:aws:iam::aws:policy/AdministratorAccess][0m
[0m[1maws_iam_user_policy.ses_sending_access: Refreshing state... [id=femiwiki-email:AmazonSesSendingAccess][0m
[0m[1maws_iam_role.femiwiki: Refreshing state... [id=Femiwiki][0m
[0m[1maws_sns_topic.cloudwatch_alarms_topic_us: Refreshing state... [id=arn:aws:sns:us-east-1:302617221463:CloudWatch_Alarms_Topic][0m
[0m[1maws_ebs_volume.persistent_data_caddycerts: Refreshing state... [id=vol-07bf923e6d5bd8159][0m
[0m[1maws_ebs_volume.persistent_data_mysql: Refreshing state... [id=vol-046c6026dc27a61de][0m
[0m[1maws_route53_record.femiwiki_com_soa: Refreshing state... [id=Z1IOLPZGUQYUUT_femiwiki.com._SOA][0m
[0m[1maws_route53_record.maintenance_femiwiki_com: Refreshing state... [id=Z1IOLPZGUQYUUT_maintenance.femiwiki.com_CNAME][0m
[0m[1maws_route53_record.verifybing_femiwiki_com: Refreshing state... [id=Z1IOLPZGUQYUUT_24475b093ea86d87f448bfcb0bbf50ee.femiwiki.com_CNAME][0m
[0m[1maws_route53_record.github_challenge_femiwiki_com: Refreshing state... [id=Z1IOLPZGUQYUUT__github-challenge-femiwiki.femiwiki.com._TXT][0m
[0m[1mdata.aws_ami.amazon_linux_2_arm64: Read complete after 2s [id=ami-0743677bdafb218f5][0m
[0m[1mdata.aws_iam_policy_document.route53: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.route53: Read complete after 0s [id=3880274244][0m
[0m[1maws_route53_record.femiwiki_com_ns: Refreshing state... [id=Z1IOLPZGUQYUUT_femiwiki.com._NS][0m
[0m[1maws_route53_record.femiwiki_com_amazonses_verification_record: Refreshing state... [id=Z1IOLPZGUQYUUT__amazonses.femiwiki.com._TXT][0m
[0m[1maws_route53_record.femiwiki_com_mx: Refreshing state... [id=Z1IOLPZGUQYUUT_femiwiki.com._MX][0m
[0m[1maws_route53_record.femiwiki_com_txt: Refreshing state... [id=Z1IOLPZGUQYUUT_femiwiki.com_TXT][0m
[0m[1maws_route53_record.amazonses_femiwiki_com_dkim_record[0]: Refreshing state... [id=Z1IOLPZGUQYUUT_5ya44psrwmbbmja25vcpxrntycwpmyap._domainkey.femiwiki.com_CNAME][0m
[0m[1maws_route53_record.amazonses_femiwiki_com_dkim_record[1]: Refreshing state... [id=Z1IOLPZGUQYUUT_adey3isneuqjaqsqibxsmqppfn33esg6._domainkey.femiwiki.com_CNAME][0m
[0m[1maws_route53_record.amazonses_femiwiki_com_dkim_record[2]: Refreshing state... [id=Z1IOLPZGUQYUUT_2yz4o5m6fz4fxc7menpiet2oh2iu34st._domainkey.femiwiki.com_CNAME][0m
[0m[1maws_iam_policy.force_mfa: Refreshing state... [id=arn:aws:iam::302617221463:policy/Force_MFA][0m
[0m[1maws_iam_user_policy.terraform_cloud: Refreshing state... [id=terraform-cloud:TerraformCloud][0m
[0m[1maws_iam_user_policy.github_lambda: Refreshing state... [id=github-lambda:GithubLambda][0m
[0m[1maws_iam_group_policy_attachment.readonly_permission: Refreshing state... [id=ReadOnly-20200105160012917500000002][0m
[0m[1maws_iam_instance_profile.femiwiki: Refreshing state... [id=Femiwiki][0m
[0m[1maws_iam_role_policy_attachment.femiwiki_cloud_watch_agent_server: Refreshing state... [id=Femiwiki-20210207063523211800000001][0m
[0m[1maws_cloudwatch_metric_alarm.bounce_rate: Refreshing state... [id=Bounce Rate][0m
[0m[1maws_cloudwatch_metric_alarm.complaint_rate: Refreshing state... [id=Complaint Rate][0m
[0m[1maws_cloudwatch_metric_alarm.femiwiki_main_page: Refreshing state... [id=Main Page awsroute53 Low-HealthCheckStatus][0m
[0m[1maws_iam_policy.route53: Refreshing state... [id=arn:aws:iam::302617221463:policy/Route53Access][0m
[0m[1maws_security_group.femiwiki: Refreshing state... [id=sg-006f422b1661b34e9][0m
[0m[1maws_default_security_group.default: Refreshing state... [id=sg-03aebf67][0m
[0m[1maws_security_group.nomad_cluster: Refreshing state... [id=sg-06786a051bc8cdcfb][0m
[0m[1maws_iam_group_policy_attachment.readonly_mfa: Refreshing state... [id=ReadOnly-20200105160012911600000001][0m
[0m[1maws_iam_group_policy_attachment.admin_mfa: Refreshing state... [id=Admin-arn:aws:iam::302617221463:policy/Force_MFA][0m
[0m[1maws_s3_bucket_public_access_block.uploaded_files_temp: Refreshing state... [id=femiwiki-uploaded-files-temp][0m
[0m[1maws_iam_role_policy_attachment.femiwiki_route53: Refreshing state... [id=Femiwiki-20191115074028791700000002][0m
[0m[1maws_s3_bucket_public_access_block.uploaded_files_deleted: Refreshing state... [id=femiwiki-uploaded-files-deleted][0m
[0m[1maws_security_group_rule.femiwiki_ingress_internal_mysql: Refreshing state... [id=sgrule-1310671871][0m
[0m[1maws_security_group_rule.femiwiki_egress: Refreshing state... [id=sgrule-3477746165][0m
[0m[1maws_security_group_rule.femiwiki_ingress_http: Refreshing state... [id=sgrule-1725284516][0m
[0m[1maws_security_group_rule.femiwiki_ingress_https: Refreshing state... [id=sgrule-3712458974][0m
[0m[1maws_security_group_rule.femiwiki_ingress_nomad: Refreshing state... [id=sgrule-3392467792][0m
[0m[1maws_security_group_rule.default_instance_connect_browser_based_client: Refreshing state... [id=sgrule-1879058093][0m
[0m[1maws_instance.femiwiki: Refreshing state... [id=i-0d6c06981a9aa5112][0m
[0m[1maws_eip.test_femiwiki: Refreshing state... [id=eipalloc-04d291f5441073ee5][0m
[0m[1mdata.aws_iam_policy_document.upload_backup: Reading...[0m[0m
[0m[1maws_s3_bucket_public_access_block.backups: Refreshing state... [id=femiwiki-backups][0m
[0m[1maws_s3_bucket_lifecycle_configuration.backups: Refreshing state... [id=femiwiki-backups][0m
[0m[1mdata.aws_iam_policy_document.upload_backup: Read complete after 0s [id=3110276906][0m
[0m[1maws_iam_policy.upload_backup: Refreshing state... [id=arn:aws:iam::302617221463:policy/UploadBackup][0m
[0m[1maws_iam_role_policy_attachment.femiwiki_upload_backup: Refreshing state... [id=Femiwiki-20191115074028891300000003][0m
[0m[1maws_route53_record.test_femiwiki_com: Refreshing state... [id=Z1IOLPZGUQYUUT_test.femiwiki.com_A][0m
[0m[1maws_s3_bucket_public_access_block.secrets: Refreshing state... [id=femiwiki-secrets][0m
[0m[1mdata.aws_iam_policy_document.download_secrets: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.s3_secrets: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.download_secrets: Read complete after 0s [id=2005388833][0m
[0m[1mdata.aws_iam_policy_document.s3_secrets: Read complete after 0s [id=3080964567][0m
[0m[1maws_iam_policy.download_secrets: Refreshing state... [id=arn:aws:iam::302617221463:policy/DownloadSecrets][0m
[0m[1maws_s3_bucket_policy.secrets: Refreshing state... [id=femiwiki-secrets][0m
[0m[1maws_iam_role_policy_attachment.femiwiki_download_secrets: Refreshing state... [id=Femiwiki-20210421142119175800000001][0m
[0m[1mdata.aws_iam_policy_document.uploaded_files: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.uploaded_files: Read complete after 0s [id=1738115289][0m
[0m[1maws_s3_bucket_policy.uploaded_files: Refreshing state... [id=femiwiki-uploaded-files][0m
[0m[1mdata.aws_iam_policy_document.uploaded_files_thumb: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.amazon_s3_access: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.uploaded_files_thumb: Read complete after 0s [id=153945145][0m
[0m[1mdata.aws_iam_policy_document.amazon_s3_access: Read complete after 0s [id=3102181997][0m
[0m[1maws_s3_bucket_policy.uploaded_files_thumb: Refreshing state... [id=femiwiki-uploaded-files-thumb][0m
[0m[1maws_iam_policy.amazon_s3_access: Refreshing state... [id=arn:aws:iam::302617221463:policy/AmazonS3Access][0m
[0m[1maws_iam_role_policy_attachment.femiwiki_amazon_s3_access: Refreshing state... [id=Femiwiki-20191115074028785800000001][0m
[0m[1maws_eip.femiwiki: Refreshing state... [id=eipalloc-052a26fa59b019390][0m
[0m[1maws_cloudwatch_metric_alarm.femiwiki_cpu_credit_balance_cloud_watch_alarm: Refreshing state... [id=Femiwiki CPU credit balance][0m
[0m[1maws_cloudwatch_metric_alarm.femiwiki_disk_used_cloud_watch_alarm: Refreshing state... [id=Femiwiki disk used][0m
[0m[1mdata.aws_iam_policy_document.mount_ebs_volumes: Reading...[0m[0m
[0m[1maws_cloudwatch_metric_alarm.femiwiki_volume_idle_time_cloud_watch_alarm: Refreshing state... [id=Femiwiki VolumeIdleTime][0m
[0m[1mdata.aws_iam_policy_document.mount_ebs_volumes: Read complete after 0s [id=3508572542][0m
[0m[1maws_iam_policy.mount_ebs_volumes: Refreshing state... [id=arn:aws:iam::302617221463:policy/MountEbsVolumes][0m
[0m[1maws_iam_role_policy_attachment.femiwiki_mount_ebs_volumes: Refreshing state... [id=Femiwiki-20201023033024948200000001][0m
[0m[1maws_route53_record.femiwiki_com: Refreshing state... [id=Z1IOLPZGUQYUUT_femiwiki.com_A][0m
[0m[1maws_route53_record.www_femiwiki_com: Refreshing state... [id=Z1IOLPZGUQYUUT_www.femiwiki.com_A][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[0m
Terraform will perform the following actions:

[1m  # aws_eip.test_femiwiki[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_eip" "test_femiwiki" {
        [1m[0mid[0m[0m                   = "eipalloc-04d291f5441073ee5"
      [32m+[0m [0m[1m[0minstance[0m[0m             = (known after apply)
        [1m[0mtags[0m[0m                 = {}
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_instance.test_femiwiki[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_instance" "test_femiwiki" {
      [32m+[0m [0m[1m[0mami[0m[0m                                  = "ami-0743677bdafb218f5"
      [32m+[0m [0m[1m[0marn[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0massociate_public_ip_address[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                    = "ap-northeast-1a"
      [32m+[0m [0m[1m[0mcpu_core_count[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mcpu_threads_per_core[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mdisable_api_stop[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mdisable_api_termination[0m[0m              = true
      [32m+[0m [0m[1m[0mebs_optimized[0m[0m                        = true
      [32m+[0m [0m[1m[0mget_password_data[0m[0m                    = false
      [32m+[0m [0m[1m[0mhost_id[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0miam_instance_profile[0m[0m                 = "Femiwiki"
      [32m+[0m [0m[1m[0mid[0m[0m                                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_initiated_shutdown_behavior[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0minstance_state[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0minstance_type[0m[0m                        = "t4g.micro"
      [32m+[0m [0m[1m[0mipv6_address_count[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mipv6_addresses[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mkey_name[0m[0m                             = "femiwiki-2018-09-15"
      [32m+[0m [0m[1m[0mmonitoring[0m[0m                           = false
      [32m+[0m [0m[1m[0moutpost_arn[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mpassword_data[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mplacement_group[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mplacement_partition_number[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mprimary_network_interface_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_dns[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0msecondary_private_ips[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0msource_dest_check[0m[0m                    = true
      [32m+[0m [0m[1m[0msubnet_id[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                                 = {
          [32m+[0m [0m"Name" = "Test Server"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                             = {
          [32m+[0m [0m"Name" = "Test Server"
        }
      [32m+[0m [0m[1m[0mtenancy[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0muser_data[0m[0m                            = "5911cadaa2223f43e6bab290b2763fdeff6d099d"
      [32m+[0m [0m[1m[0muser_data_base64[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0muser_data_replace_on_change[0m[0m          = false
      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = [
          [32m+[0m [0m"sg-006f422b1661b34e9",
          [32m+[0m [0m"sg-03aebf67",
          [32m+[0m [0m"sg-06786a051bc8cdcfb",
        ]

      [32m+[0m [0mcapacity_reservation_specification {
          [32m+[0m [0m[1m[0mcapacity_reservation_preference[0m[0m = (known after apply)

          [32m+[0m [0mcapacity_reservation_target {
              [32m+[0m [0m[1m[0mcapacity_reservation_id[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mcapacity_reservation_resource_group_arn[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mcredit_specification {
          [32m+[0m [0m[1m[0mcpu_credits[0m[0m = "unlimited"
        }

      [32m+[0m [0mebs_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }

      [32m+[0m [0menclave_options {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mephemeral_block_device {
          [32m+[0m [0m[1m[0mdevice_name[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mno_device[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_name[0m[0m = (known after apply)
        }

      [32m+[0m [0mmaintenance_options {
          [32m+[0m [0m[1m[0mauto_recovery[0m[0m = (known after apply)
        }

      [32m+[0m [0mmetadata_options {
          [32m+[0m [0m[1m[0mhttp_endpoint[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhttp_tokens[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0minstance_metadata_tags[0m[0m      = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_index[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_card_index[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m  = (known after apply)
        }

      [32m+[0m [0mprivate_dns_name_options {
          [32m+[0m [0m[1m[0menable_resource_name_dns_a_record[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhostname_type[0m[0m                        = (known after apply)
        }

      [32m+[0m [0mroot_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = true
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = 8
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = "gp3"
        }
    }

[0m[1mPlan:[0m 1 to add, 1 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0mtest_nomad_addr[0m[0m = (known after apply)

```

</details>

*Pusher: @lens0021, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*